In [ ]:
%%sql
postgresql:///sports

SELECT *
FROM info
LIMIT 5;

5 rows affected.

[(None, 'AH2430', None),
 ("Women's adidas Originals Sleek Shoes", 'G27341', 'A modern take on adidas sport heritage, tailored just for women. Perforated 3-Stripes on the leather upper of these shoes offer a sleek look that mirrors iconic tennis styles.'),
 ("Women's adidas Swim Puka Slippers", 'CM0081', "These adidas Puka slippers for women's come with slim straps for a great fit. Feature performance logo on the footbed and textured Rubber outsole that gives unique comfort."),
 ("Women's adidas Sport Inspired Questar Ride Shoes", 'B44832', "Inspired by modern tech runners, these women's shoes step out with unexpected style. They're built with a breathable knit upper, while the heel offers the extra support of an Achilles-hugging design. The cushioned midsole provides a soft landing with every stride."),
 ("Women's adidas Originals Taekwondo Shoes", 'D98205', "This design is inspired by vintage Taekwondo styles originally worn to perfect high kicks and rapid foot strikes. The canvas shoes make a streetwear fashion statement as a chic, foot-hugging slip-on. They're shaped for a narrow, women's-specific fit and ride on a soft gum rubber outsole.")]

In [ ]:
%%sql

SELECT *
FROM finance
limit 5;

 * postgresql:///sports
5 rows affected.

[('AH2430', None, None, None, None),
 ('G27341', 75.99, 37.99, 0.5, 1641.17),
 ('CM0081', 9.99, 5.99, 0.4, 398.93),
 ('B44832', 69.99, 34.99, 0.5, 2204.37),
 ('D98205', 79.99, 39.99, 0.5, 5182.7)]

In [ ]:
%%sql

SELECT *
FROM reviews
limit 5;

 * postgresql:///sports
5 rows affected.

[('AH2430', None, None),
 ('G27341', 3.3, 24.0),
 ('CM0081', 2.6, 37.0),
 ('B44832', 4.1, 35.0),
 ('D98205', 3.5, 72.0)]

In [ ]:
%%sql

SELECT *
FROM traffic
limit 5;

 * postgresql:///sports
5 rows affected.

[('AH2430', datetime.datetime(2018, 5, 19, 15, 13)),
 ('G27341', datetime.datetime(2018, 11, 29, 16, 16)),
 ('CM0081', datetime.datetime(2018, 2, 1, 10, 27)),
 ('B44832', datetime.datetime(2018, 9, 7, 20, 6)),
 ('D98205', datetime.datetime(2019, 7, 18, 15, 26))]

In [ ]:
%%sql

SELECT *
FROM brands
limit 5;

 * postgresql:///sports
5 rows affected.

[('AH2430', None),
 ('G27341', 'Adidas'),
 ('CM0081', 'Adidas'),
 ('B44832', 'Adidas'),
 ('D98205', 'Adidas')]

In [ ]:
%%sql

SELECT brand, count(brand)
FROM brands
GROUP BY brand;

 * postgresql:///sports
3 rows affected.

[(None, 0), ('Nike', 545), ('Adidas', 2575)]

In [ ]:
%%sql
postgresql:///sports

-- 1. Count all columns and compare with total rows to have an idea abput the missing values

SELECT COUNT(*) AS total_rows,
    COUNT(i.description) AS count_description,
    COUNT(f.listing_price) AS count_listing_price,
    COUNT(r.reviews) AS count_reviews,
    COUNT(t.last_visited) AS count_last_visited,
    COUNT(b.brand) AS count_brand
FROM info AS i
INNER JOIN finance AS f
    ON i.product_id = f.product_id
INNER JOIN reviews AS r
    ON f.product_id = r.product_id
INNER JOIN traffic AS t
    ON t.product_id = r.product_id
INNER JOIN brands AS b
    ON t.product_id = b.product_id;

1 rows affected.

[(3179, 3117, 3120, 3120, 2928, 3120)]

In [ ]:
%%sql

-- 2.Exploring brands

SELECT DISTINCT brand
FROM brands;

 * postgresql:///sports
3 rows affected.

[(None,), ('Nike',), ('Adidas',)]

In [ ]:
%%sql

-- 3.Compare brands (Nike and Adidas) listings prices

SELECT b.brand,
       f.listing_price::integer,
       count(f.*)
FROM brands AS b
INNER JOIN finance AS f
    ON b.product_id=f.product_id
WHERE listing_price > 0
Group BY b.brand, f.listing_price
ORDER BY listing_price DESC;

-- 77 unique prices

 * postgresql:///sports
77 rows affected.

[('Adidas', 300, 2),
 ('Adidas', 280, 4),
 ('Adidas', 240, 5),
 ('Adidas', 230, 8),
 ('Adidas', 220, 11),
 ('Nike', 200, 1),
 ('Adidas', 200, 8),
 ('Nike', 190, 2),
 ('Adidas', 190, 7),
 ('Nike', 180, 4),
 ('Adidas', 180, 34),
 ('Nike', 170, 14),
 ('Adidas', 170, 27),
 ('Nike', 160, 31),
 ('Adidas', 160, 28),
 ('Adidas', 150, 41),
 ('Nike', 150, 6),
 ('Adidas', 140, 36),
 ('Nike', 140, 12),
 ('Adidas', 130, 96),
 ('Nike', 130, 12),
 ('Adidas', 120, 115),
 ('Nike', 120, 16),
 ('Nike', 110, 17),
 ('Adidas', 110, 91),
 ('Nike', 100, 14),
 ('Adidas', 100, 72),
 ('Adidas', 96, 2),
 ('Nike', 95, 1),
 ('Nike', 90, 13),
 ('Adidas', 90, 89),
 ('Adidas', 86, 7),
 ('Nike', 85, 5),
 ('Adidas', 85, 1),
 ('Adidas', 80, 322),
 ('Nike', 80, 16),
 ('Nike', 79, 1),
 ('Adidas', 76, 149),
 ('Adidas', 75, 1),
 ('Nike', 75, 7),
 ('Adidas', 70, 87),
 ('Nike', 70, 4),
 ('Adidas', 66, 102),
 ('Nike', 65, 1),
 ('Adidas', 63, 1),
 ('Nike', 60, 2),
 ('Adidas', 60, 211),
 ('Adidas', 56, 174),
 ('Adidas', 55, 2),
 ('Adidas', 53, 43),
 ('Nike', 50, 5),
 ('Adidas', 50, 183),
 ('Adidas', 48, 42),
 ('Nike', 48, 1),
 ('Adidas', 46, 163),
 ('Nike', 45, 3),
 ('Adidas', 45, 1),
 ('Adidas', 43, 51),
 ('Adidas', 40, 81),
 ('Nike', 40, 1),
 ('Adidas', 38, 24),
 ('Adidas', 36, 25),
 ('Adidas', 33, 24),
 ('Adidas', 30, 37),
 ('Nike', 30, 2),
 ('Adidas', 28, 38),
 ('Adidas', 27, 18),
 ('Adidas', 25, 28),
 ('Adidas', 23, 1),
 ('Adidas', 20, 8),
 ('Adidas', 18, 4),
 ('Adidas', 16, 4),
 ('Adidas', 15, 27),
 ('Adidas', 13, 27),
 ('Adidas', 12, 1),
 ('Adidas', 10, 11),
 ('Adidas', 9, 1)]

In [ ]:
%%sql

-- 4. Creating a price range to have a better idea of sales of each price category

SELECT b.brand,
       COUNT(f.*),
       SUM(f.revenue) as total_revenue,
       CASE WHEN f.listing_price < 50 THEN 'Budget'
            WHEN f.listing_price >= 50 AND f.listing_price < 75 THEN 'Average'
            WHEN f.listing_price >= 75 AND f.listing_price < 100 THEN 'Expensive'
            ELSE 'Elite' END AS price_category
FROM finance AS f
INNER JOIN brands AS b
    ON f.product_id = b.product_id
WHERE b.brand IS NOT NULL AND listing_price > 0
GROUP BY b.brand, price_category
ORDER BY total_revenue DESC;

 * postgresql:///sports
8 rows affected.

[('Adidas', 513, 4451434.25, 'Elite'),
 ('Adidas', 642, 3186514.65, 'Expensive'),
 ('Adidas', 621, 2087977.499999999, 'Average'),
 ('Adidas', 799, 1800692.6800000004, 'Budget'),
 ('Nike', 115, 155260.3500000001, 'Elite'),
 ('Nike', 50, 43439.20000000001, 'Expensive'),
 ('Nike', 12, 5911.75, 'Budget'),
 ('Nike', 14, 2676.1099999999997, 'Average')]

In [ ]:
%%sql

-- 5. Calculating averagr discpunt of each brand

SELECT b.brand,
       AVG(f.discount)*100 AS average_discount,
       SUM(f.revenue) as total_revenue
FROM brands AS b
INNER JOIN finance AS f
    ON b.product_id = f.product_id
GROUP BY b.brand
HAVING b.brand IS NOT NULL
ORDER BY average_discount;

 * postgresql:///sports
2 rows affected.

[('Nike', 0.0, 802283.2599999993),
 ('Adidas', 33.452427184465606, 11526619.080000037)]

In [ ]:
%%sql

-- Surprisingly, Nike products has no discount in this dataset.
-- In comparison, not only do Adidas products generate the most revenue, but these products are also heavily discounted!

-- 6. finding Adidas average discount for each product category

SELECT b.brand,
       COUNT(f.*),
       AVG(f.discount)*100 AS average_discount,
       SUM(f.revenue) as total_revenue,
       CASE WHEN f.listing_price < 50 THEN 'Budget'
            WHEN f.listing_price >= 50 AND f.listing_price < 75 THEN 'Average'
            WHEN f.listing_price >= 75 AND f.listing_price < 100 THEN 'Expensive'
            ELSE 'Elite' END AS price_category
FROM finance AS f
INNER JOIN brands AS b
    ON f.product_id = b.product_id
WHERE b.brand = 'Adidas'
GROUP BY b.brand, price_category
ORDER BY total_revenue DESC;

 * postgresql:///sports
4 rows affected.

[('Adidas', 513, 29.395711500974713, 4451434.25, 'Elite'),
 ('Adidas', 642, 33.16199376947051, 3186514.65, 'Expensive'),
 ('Adidas', 621, 36.44122383252829, 2087977.499999999, 'Average'),
 ('Adidas', 799, 33.96745932415527, 1800692.6800000004, 'Budget')]

In [ ]:
%%sql

-- 7. Coorelation between revenue and discount/price

-- To improve revenue further, the company could try to reduce the amount of discount offered on Adidas products.
-- Lets explore the coorelation between discount and revenue.

SELECT corr(revenue, discount) AS revenue_discount_corr,
       corr(revenue, listing_price) AS revenue_price_corr
FROM finance;

-- There is a weak negative and negative correlation between revenue and discount.
-- There is a positve and relatively considerable correlation between revenue and price.

 * postgresql:///sports
1 rows affected.

[(-0.12477306443300586, 0.47895093705399755)]

In [ ]:
%%sql

-- 8. Rating or Reviews or both?

SELECT corr(rating, reviews) AS ratings_reviews_corr
FROM reviews;

-- They are not strongly corrolated. So, we should incorporate both in the Analyses.

 * postgresql:///sports
1 rows affected.

[(0.1250511569304693,)]

In [ ]:
%%sql

-- 9. Correlation between revenue, rating, and reviews:

SELECT corr(r.reviews, f.revenue) AS review_revenue_corr,
       corr(r.rating, f.revenue) AS rating_revenue_corr
FROM reviews AS r
INNER JOIN finance AS f
    ON r.product_id = f.product_id;

-- There is a positive considerable correlation between reviews and revenue on a product.

 * postgresql:///sports
1 rows affected.

[(0.6518512283481301, 0.1144933557384944)]

In [ ]:
%%sql

-- 10. Reviews and Description (length)

-- Perhaps there is a relationship between product description length and product reviews

SELECT TRUNC(LENGTH(i.description), -2) AS description_length,
       ROUND(AVG(r.reviews::numeric),2) AS average_reviews
FROM reviews AS r
INNER JOIN info AS i
    ON r.product_id=i.product_id
WHERE i.description IS NOT NULL
GROUP BY description_length
ORDER BY description_length;

-- Although there is 8 times less average review for less than 100 characters of description-
-- comparing to the others between 100 and 200 characters,
-- there is no strong correlation between description length and reviews.

 * postgresql:///sports
7 rows affected.

[(Decimal('0'), Decimal('4.00')),
 (Decimal('100'), Decimal('33.00')),
 (Decimal('200'), Decimal('42.68')),
 (Decimal('300'), Decimal('44.52')),
 (Decimal('400'), Decimal('42.69')),
 (Decimal('500'), Decimal('56.80')),
 (Decimal('600'), Decimal('54.53'))]

In [ ]:
%%sql

SELECT corr(LENGTH(i.description), r.reviews) AS descriptionLength_reviews_corr
FROM reviews AS r
INNER JOIN info as i
    ON r.product_id = i.product_id;

-- there doesnt appear to be a clear pattern between the length of a products description and its rating

 * postgresql:///sports
1 rows affected.

[(0.09675761989627682,)]

In [ ]:
%%sql

-- 11. Reviews by month and brand

-- So far a correlation between reviews and revenue is evident.
-- lets take a look at the volume of reviews by month to see if there are any trends we can exploit.

SELECT b.brand,
       count(r.reviews) AS num_reviews,
       DATE_PART('month',t.last_visited) AS month
FROM reviews AS r
INNER JOIN traffic as t
    ON r.product_id=t.product_id
INNER JOIN brands as b
    ON t.product_id=b.product_id
GROUP BY brand, month
HAVING b.brand IS NOT NULL
    AND DATE_PART('month',t.last_visited) IS NOT NULL
ORDER BY b.brand, month;

-- There is a seasonality for both brands. The highest amount of reviews are in winter, following by fall.
-- The companies can be benefitted by encouraging customers to write reviews in summer and spring.

 * postgresql:///sports
24 rows affected.

[('Adidas', 253, 1.0),
 ('Adidas', 272, 2.0),
 ('Adidas', 269, 3.0),
 ('Adidas', 180, 4.0),
 ('Adidas', 172, 5.0),
 ('Adidas', 159, 6.0),
 ('Adidas', 170, 7.0),
 ('Adidas', 189, 8.0),
 ('Adidas', 181, 9.0),
 ('Adidas', 192, 10.0),
 ('Adidas', 150, 11.0),
 ('Adidas', 190, 12.0),
 ('Nike', 52, 1.0),
 ('Nike', 52, 2.0),
 ('Nike', 55, 3.0),
 ('Nike', 42, 4.0),
 ('Nike', 41, 5.0),
 ('Nike', 43, 6.0),
 ('Nike', 37, 7.0),
 ('Nike', 29, 8.0),
 ('Nike', 28, 9.0),
 ('Nike', 47, 10.0),
 ('Nike', 38, 11.0),
 ('Nike', 35, 12.0)]

In [ ]:
%%sql

-- 12. Studying Products performance

-- A Common Table Expression (CTE) to filter description for keywords: Footwear
-- Investigating the median of the revenue from this product category

WITH footwear AS
(
    SELECT i.description,
           f.revenue
    FROM info AS i
    INNER JOIN finance AS f
        ON i.product_id=f.product_id
    WHERE description IS NOT NULL
        AND i.description ILIKE '%shoe%'
        OR i.description ILIKE '%trainer%'
        OR i.description ILIKE '%foot%'
        OR i.description ILIKE '%sneaker%'
        OR i.description ILIKE '%sandal%'
        OR i.description ILIKE '%slipper%'
)

SELECT COUNT(*) AS num_foot_products,
    percentile_disc(0.5) WITHIN GROUP (ORDER BY revenue) AS median_foot_revenue
FROM footwear;

 * postgresql:///sports
1 rows affected.

[(2760, 3060.0)]

In [ ]:
%%sql

-- Compare footwear performance with other products

WITH footwear AS
(
    SELECT i.description,
           f.revenue
    FROM info AS i
    INNER JOIN finance AS f
        ON i.product_id=f.product_id
    WHERE description IS NOT NULL
        AND i.description ILIKE '%shoe%'
        OR i.description ILIKE '%trainer%'
        OR i.description ILIKE '%foot%'
        OR i.description ILIKE '%sneaker%'
        OR i.description ILIKE '%sandal%'
        OR i.description ILIKE '%slipper%'
)

SELECT COUNT(i.*) AS num_nofoot_products,
    percentile_disc(0.5) WITHIN GROUP (ORDER BY f.revenue) AS median_nofoot_revenue
FROM info AS i
INNER JOIN finance AS f
    ON i.product_id = f.product_id
WHERE i.description NOT IN (SELECT description FROM footwear);

-- The category of footwears is almost 8 times larger in size and median revenue than other products combined

 * postgresql:///sports
1 rows affected.

[(357, 453.44)]